Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: You may use invisible border to achieve this inside of the passage.
ru_ru: Вы можете использовать\break невидимую (invisible) границу для расположения внутри хода.

source: You may use standard |draw| and similar macros without setting of { T} variable in pattern definitions.
ru_ru: Вы можете использовать стандартный |draw| и аналогичные\break макросы без установки переменной { T} в определениях шаблонов.

source: You may use |group cave-centerline|, |group surface-centerline|, |point cave-station|, |point surface-station| and {5.4}|group text| in |symbol-hide| and |symbol-show| commands.
ru_ru: Вы можете использовать |group cave-centerline|, |group surface-centerline|,\break |point cave-station|, |point surface-station| и {5.4}|group text| в командах |symbol-hide| и |symbol-show|.

source: You need to explicitly specify encoding (maximum 256 characters from the font that will be used).
ru_ru: Вам нужно явно указать кодировку (не более 256 символов из шрифта, который будет использоваться).

source: You should see lines
ru_ru: Вы должны видеть строки

source: You'll stay in `insert' mode---each click on the working area adds a new point symbol.
ru_ru: Вы останетесь в режиме `вставки' -- каждый щелчок по рабочей области добавляет новый символ точки.

source: [Works on Windows only.] When set to |off| (default), Therion temporarily clears all environment variables related to .
ru_ru: Работает только в Windows. Когда установлено значение |off| (по\break умолчанию), Therion временно очищает все переменные среды, связанные с .

source: `Best' means that the sum of squared distances between corresponding stations before and after transformation is minimal.
ru_ru: 'Лучше всего' означает, что сумма квадратов расстояний между соответствующими станциями до и после трансформации минимальна.

source: `UTF-8' (Unicode) and `ASCII' (7 bit) encodings are always supported.
ru_ru: Кодировки `UTF-8' (Unicode) и `ASCII' (7 бит) всегда поддерживаются.

source: ``A program should do one thing, and do it well.'' (Ken Thompson) Therefore we use some valuable external programs, which are related to the problems of typesetting and data visualization.
ru_ru: ``Программа должна делать одну задачу, и должна делать это хорошо'' (Кен Томпсон). Поэтому мы используем несколько внешних программ, которые обрабатывают и визуализируют данные.

source: `|infer equates on|' will case program to interpret shots with 0 length as equate commands (which means that no tape corrections are applied) * |declination <value> <units>| = sets the declination for subsequent shots $$truebearing = measuredbearing + declination.$$ The declination is positive when the magnetic north is east of true north.
ru_ru: `|infer equates on|' программа будет интерпретировать замеры с длиной 0 в\break качестве команды equate (что означает, что не применяются никакие\break корректировки длины). * |declination <значение> <единицы>| = задает склонение для последующих замеров $$истинныйазимут = измеренныйазимут + склонение$$ Склонение положительно, когда магнитный север находится к востоку от истинного севера.

source: all survex prefixes are taken into account and if surveys with corresponding names do not exist, they are created.
ru_ru: все префиксы survex обрабатываются, и если съемки с соответствующими именами не существуют, то они создаются.

source: and finally the area u:bat symbol (pattern in this case)
ru_ru: и, наконец, область символа u:bat (шаблон в этом случае)

source: but in the { use-in.th} file using
ru_ru: но в файле { use-in.th}, используя

source: but there is still a problem with a branch containing station 5.
ru_ru: но по-прежнему существует проблема с ниткой, содержащей станцию 5.

source: current limit: $4 (scraps + sections) < 4096$ (may be arbitrarily increased)
ru_ru: текущий предел : $4 (скрапы + сечения) < 4096$ (может быть\break произвольно увеличено)

source: def a_u_bat (expr Path) = T:=identity; thclean Path; thfill Path withpattern pattern_bat; enddef; |
ru_ru: |beginpattern(pattern_bat); fill bat_path withcolor black; endpattern; |%| bat pattern def a_u_bat (expr Path) = T:=identity; thclean Path; thfill Path withpattern pattern_bat; enddef; |

source: etc/TXSruled.tex { Comment}
ru_ru: etc/TXSruled.tex { Комментарий}

source: etc/TXSruled.tex { Title}
ru_ru: etc/TXSruled.tex { Наименование}

source: in the centerline.
ru_ru: в centerline.

source: in the preview window above the { Insert scrap} button.
ru_ru: в окне предварительного просмотра над кнопкой { Вставить скрап}.

source: in your layout, station with continuation flag specified is marked by question mark (continuation symbol is shown above the station).
ru_ru: в вашем layout станция с указанным символом продолжения помечена знаком вопроса (символ продолжения отображается над станцией).

source: inserts the contents of a file in place of the command.
ru_ru: Вставляет содержимое файла на место команды.

source: loch, dxf, esri, compass, survex, vrml, 3dmf, kml map
ru_ru: loch, dxf, esri, compass, survex, vrml, 3dmf, kml map (карта)

source: map m1 -title "Test map" s1 endmap
ru_ru: map m1 -title "Тестовая карта" s1 endmap

source: not all stations are replaced correctly.
ru_ru: не все станции будут заменены правильно.

source: or
ru_ru: или

source: or, if there are more nesting levels
ru_ru: или, если есть больше уровней вложения

source: pdf, svg, xhtml, dxf, esri, survex, xvi, kml, {5.3}bbox atlas
ru_ru: pdf, svg, xhtml, dxf, esri, survex, xvi, kml, {5.3}bbox atlas (атлас)

source: pdf database
ru_ru: pdf database (база данных)

source: pdflimit: $2 pages + images + patterns + 6 (scraps + sections) < 32500$
ru_ru: предел pdf: $2 страницы + изображения + шаблоны + 6 (скрапы + сечения)\break < 32500$

source: right after |import| command, you refer to stations in .th2 file with names shown on the map.
ru_ru: прямо после команды |import|, то вы ссылаетесь на станции в файле .th2 с именами, указанными на карте.

source: selects objects (surveys and maps) for export.
ru_ru: выбирает объекты (съемки и карты) для экспорта.

source: sets the encoding of input file.
ru_ru: Устанавливает кодировку входного файла.

source: sql, {5.4}csv lists
ru_ru: sql, {5.4}csv lists (списки)

source: survey / allonly with .3d files, where survey structure is specified]
ru_ru: survey / allТолько с .3d-файлами, в которых задана структура съемки.]

source: survey main -title "Test cave"
ru_ru: survey main -title "Тестовая пещера"

source: to the pdf's map file.
ru_ru: в pdf\ файл карты.

source: unless it's compiled into Therion executable.
ru_ru: если он не скомпилирован в исполняемый файл Therion'а.

source: where { arg1 ... argN} are obligatory arguments, and pairs { -option value} are options, which you may freely omit.
ru_ru: где { арг1 ... аргN} являются обязательными аргументами, а пары { -опция значение} являются параметрами, которые вы можете опустить.

source: where { point} is a keyword for point symbol followed by its coordinates and a symbol type specification.
ru_ru: где { point} -- команда для символа точки, за которым следуют его координаты и специфический тип символа.

source: which defines the landscape A4 layout without the navigator nor any texts.
ru_ru: который определяет размер формата A4 без навигатора и любых текстов.

source: which displays north arrow in the upper-left corner of the map sheet.
ru_ru: который отображает стрелку на север в верхнем левом углу листа карты.

source: which is followed by a mass of SQL insert commands.
ru_ru: за которым следуют команды SQL `insert'.

source: with three obligatory arguments and one optional option/value pair.
ru_ru: с тремя обязательными аргументами и одной дополнительной парой\break опция/значение.

source: you need to create more complicated map structure to handle this.
ru_ru: вам нужно создать более сложную структуру карты, чтобы отобразить это правильно.

source: {5.3} If one of the shot stations is named either `|.|' or `|-|', the shot has |splay| attribute set.
ru_ru: {5.3} Если в замере одна из станций имеет название `|.|' или `|-|', то у замера устанавливается атрибут |splay|.

source: {5.3} |<rtl>| and |</rtl>| = marks beginning and end of a right-to-left written text
ru_ru: {5.3} |<rtl>| и |</rtl>| = отмечает начало и конец вывода текста справа налево;

source: {5.3}If the map was produced using georeferenced data then it also contains georeferencing information.
ru_ru: {5.3}Если карта была создана с использованием данных с привязкой, то она также содержит информацию о геопривязке.

source: {5.3}Outside of |layout| command specifies the coordinate system for output.
ru_ru: {5.3}Вне команды |layout| определяет систему координат для вывода.

source: {5.3}Sets the output language for translatable texts.
ru_ru: {5.3}Устанавливает язык вывода для переводимых текстов.

source: {5.3}Temporary hack to set sampling distance in meters when generating piecewise linear 3d model from passage walls made of Bezier curves.
ru_ru: {5.3}Установить расстояние дискретизации в метрах при генерации стен\break 3d-модели из кривых Безье.

source: {5.3}{ Help/Calibrate bitmap} produces OziExplorer-compatible MAP file based on georeferencig data included in a PDF mapCalibration information for nine distinct points is present if centreline contains station(s) fixed using geodetic coordinate system(s)].
ru_ru: {5.3}{ Помощь/Привязать изображение} создает файл MAP совместимый с\break OziExplorer на основе геоданных включенных в карту PDFМожет присутствовать до девяти калибровочных точек в виде фиксированных станций в нитке хода с использованием геодезической системы координат.].

source: {5.3}{ PocketTopo data} exported in Therion formatThis is a special text format which needs to be imported using XTherion and can not be processed by Therion directly.] from PocketTopo application can be imported in text editor as well as in map editor ({ File $$ Import $$ PocketTopo therion export} and { Backgroud Images $$ Insert $$ PocketTopo therion export}).
ru_ru: {5.3}{ Данные PocketTopo} экспортированные в формате Therion'аЭто специальный текстовый формат, который нужно импортировать с помощью\break XTherion'а и не может обрабатываться непосредственно Therion'ом.] из приложения PocketTopo можно импортировать в текстовом редакторе, а также в\break редакторе карт ({ Файл $$ Импорт $$ PocketTopo therion export} и { Фоновые изображения $$ Вставить $$ PocketTopo therion export}).

source: {5.3}|<lang:XX>| = creates multilingual label (see |string| type for detailed description)
ru_ru: {5.3}|<lang:XX>| = создает многоязычную текстовую метку (подробнее смотрите описание типа |string|).

source: {5.4} This option can be used to reduce size of sketch bitmap images in maps.
ru_ru: {5.4} Этот параметр можно использовать для уменьшения размера растровых\break изображений эскиза на картах.

source: {5.4}The following variables are also available:
ru_ru: {5.4}Доступны также следующие переменные:

source: { Altitude} Tunnel cave
ru_ru: { Высота н.у.м.} Пещера Туннель

source: { Areas} are specified by their surrounding lines.
ru_ru: { Области} определяются окружающими их линиями.

source: { Arguments:} a list of the obligatory arguments with explanations.
ru_ru: { Аргументы:} список обязательных аргументов с пояснениями.

source: { Code} water too cold to continue survey
ru_ru: { Код} слишком холодная вода

source: { Command-like options:} options for multi-line commands, which can be specified among the data lines.
ru_ru: { Опции командной строки:} для многострочных команд, которые могут быть указаны среди строк данных.

source: { Context:} specifies the context in which is this command allowed.
ru_ru: { Контекст:} указывает контекст, в котором используется эта команда.\break

source: { Description:} notes concerning this command.
ru_ru: { Описание:} примечания относительно этой команды.

source: { Drawing area and background images}
ru_ru: { Область рисования и фоновые изображения}

source: { Drawing lines} is similar to drawing in other vector editing programs, which work with Bezier curves.
ru_ru: { Рисование линий} аналогично рисованию в других программах\break редактирования векторной графики, которые работают с кривыми Безье.

source: { How long are passages lying between 1500 and 1550 m a.s.l.?}
ru_ru: { Какова длина ходов промежутка между 1500 и 1550 м глубины?}

source: { Installation from sources (therion-5.*.tar.gz package):}
ru_ru: { Установка из исходников (therion-5.*.tar.gz package):}

source: { Note:} Map previews are displayed only as specified in maps in the current |map-level|.
ru_ru: { Примечание:} Предварительный просмотр карт отображается только в соответствии с картами в текущем |map-level|.

source: { Options:} a list of the available options.
ru_ru: { Опции:} список доступных опций.

source: { Options} box preserves the old value and it's enough to change a few characters.
ru_ru: Поле { Опции} сохраняет старое значение, и достаточно изменить всего несколько символов

source: { Syntax:} schematic syntax description.
ru_ru: { Синтаксис:} описание синтаксиса.

source: { Translated by}{} bg
ru_ru: { Переводчики}{} bg

source: { Which parts of the cave were surveyed in the year 1998?}
ru_ru: { Какие части пещеры были отсняты в 1998 году?}

source: { air-draught:} |winter|, |summer|, |undefined| (default);
ru_ru: { air-draught (ток воздуха):} |winter| (зимой), |summer| (летом), |undefined| (не определено) (по умолчанию);

source: { altitude:} the value specified is the altitude difference from the nearest station.
ru_ru: { altitude (высотная отметка):} указанное значение представляет собой\break разницу высот по сравнению с ближайшей станции.

source: { available formats}{} model
ru_ru: { поддерживаемые форматы}{} model (модель)

source: { border:} |visible| (default), |invisible|, |temporary|, |presumed|;
ru_ru: { border (граница):} |visible| (видимая) (по умолчанию), |invisible|\break (не отображаемая), |temporary| (временная), |presumed| (предполагаемая);

source: { common:} * |encoding/enc <encoding>| = set output encoding * |output/o <file>| = set output file name.
ru_ru: { общие:} * |encoding/enc <кодировка>| = установить кодировку вывода. * |output/o <файл>| = установить выходной файл.

source: { dimensions:} |-value [<above> <below> [<units>]]| specifies passage dimensions a­bo­ve/below centerline plane used in 3D model.
ru_ru: { dimensions (размеры хода):} |-value [<выше> <ниже> [<единицы>]]|\break определяет размеры ходов выше/ниже плоскости нитки хода, используется в 3D-модели.

source: { equipment:} |anchor|, |rope|, |fixed-ladder|, |rope-ladder|, |steps|, |bridge|, |traverse|, |camp|, |no-equipment|;
ru_ru: { оборудование:} |anchor| (ИТО), |rope| (веревка), |fixed-ladder| (жесткая\break лестница), |rope-ladder| (гибкая лестница), |steps| (ступени), |bridge| (мост),\break |traverse| (троллей), |camp| (ПБЛ), |no-equipment| (снаряжение отсутствует);

source: { height:} according to the sign of the value (positive, negative or unsigned), this type of symbol represents chimney height, pit depth or step height in general.
ru_ru: { height (высота уступа/камина/колодца):} в зависимости от знака значения (положительный, отрицательный или без знака), этот тип символа\break представляет собой высоту трубы, глубину колодца или высоту уступа.

source: { labels:} |label|, |remark|, |altitude|General altitude label.
ru_ru: { метки:} |label| (текстовая метка), |remark| (заметка), |altitude|Знак общей высоты.

source: { labels:} |label|;
ru_ru: { текстовые метки:} |label| (текстовая метка);

source: { others:} |dig|, |archeo-material|, |paleo-material|, |vegetable-debris|, |root|, |water-flow|, |spring|Always use |spring| and |sink| symbols with a |water-flow| arrow.], |sink|, {5.4}|ice-stalactite|, |ice-stalagmite|, |ice-pillar|, |gradient|, |air-draught|Number of ticks is set according to |-scale| option], |map-connection|Virtual point, used to indicate connection between shifted maps (extended elevation, map offset).], |extra|Additional morphing point.], |u|For user defined point symbols.].
ru_ru: { другие:} |dig| (раскоп), |archeo-material| (археологическая находка),\break |paleo-material| (палео-находка), |vegetable-debris| (останки растительности), |root| (корни растений), |water-flow| (водоток), |spring| (источник)Всегда используйте символы |spring| (источник) и |sink| (понор) со стрелкой |water-flow| (водоток).], |sink|\break (понор), {5.4}|ice-stalactite| (ледяной сталактит), |ice-stalagmite| (ледяной\break сталагмит), |ice-pillar| (ледяная колонна, ледяной сталагнат), |gradient| (уклон хода), |air-draught| (ток воздуха)Количество штрихов на стрелке устанавливается в зависимости от опции |-scale|\break (масштаб). Примечание переводчика: по рекомендациям международной системы\break обозначений должно быть всегда два штриха.], |map-connection| (соединение выносок\break карт)Виртуальная точка, используемая для указания соединения между выносками карт\break (разрез-развертка, смещение карты).], |extra| (точка морфинга), |u|Пользовательские точечные символы.] (пользовательский).

source: { passage ends:} |continuation|, |narrow-end|, |low-end|, |flowstone-choke|, |breakdown-choke|, {5.4}|clay-choke|, |entrance|;
ru_ru: { окончание ходов:} |continuation| (продолжение, возможное продолжение),\break |narrow-end| (вертикальная узость), |low-end| (горизонтальная узость),\break |flowstone-choke| (блокировано натеками), |breakdown-choke| (блокировано\break обвалом), {5.4}|clay-choke| (блокировано глиной), |entrance| (вход);

source: { passage fills:} |flowstone|, |moonmilk|, |rock-border|Outer outline of large boulders.
ru_ru: { заливка ходов:} |flowstone| (натечный каскад), |moonmilk| (мондмильх),\break |rock-border| (внешняя кромка глыбы)Внешние границы крупных валунов.

source: { passage-height:} the following four forms of value are supported: |+<number>| (the height of the ceiling), |-<number>| (the depth of the floor or water depth), |<number>| (the distance between floor and ceiling) and |[+<number> -<number>]| (the distance to ceiling and distance to floor).
ru_ru: { passage-height (высота хода):} поддерживаются следующие четыре формы значения: |+<число>| (высота потолка), |-<число>| (глубина этажа или\break глубина воды), |<число>| (расстояние между потолком и полом) и |[+<число> -<число>]| (расстояние до потолка и расстояние до пола).

source: { passages:} |wall|, |contour|, |slope|Slope line marks upper border of the sloping area.
ru_ru: { символы ходов:} |wall| (стена), |contour| (контур), |slope| (склон)Линия склона обозначает верхнюю границу области склона.

source: { special objects:} |station|Survey station.
ru_ru: { специальные объекты:} |station|Станция съемки.

source: { special:} |border|, |arrow|, |section|Line showing cross-section position.{5.3} If both control points (red dots) of a Bezier curve (grey line) are given then the section line (blue) is drawn up to the perpendicular projection (dotted) of the first control point and from the projection (dotted) of the section control point.
ru_ru: { специальные:} |border| (граница), |arrow| (стрелка), |section| (выносная линия сечения)Линия показывает положение поперечного сечения.{5.3} Если заданы обе контрольные точки (красные точки) кривой Безье (серая линия), то линия сечения (синяя) отображается до места перпендикуляра проекции (пунктир) первой и второй контрольных точек сечения.

source: { speleothems:} |flowstone|, |moonmilk|, |stalactite|, |stalagmite|, |pillar|, |curtain|, |helictite|, |soda-straw|, |crystal|, |wall-calcite|, |popcorn|, |disk|, |gypsum|, |gypsum-flower|, |aragonite|, |cave-pearl|, |rimstone-pool|, |rimstone-dam|, |anastomosis|, |karren|, |scallop|, |flute|, |raft-cone|, {5.4}|clay-tree|;
ru_ru: { спелео-формы:} |flowstone| (натечный каскад), |moonmilk| (мондмильх),\break |stalactite| (сталактиты), |stalagmite| (сталагмиты), |pillar| (колонны,\break сталагнаты), |curtain| (натечный занавес), |helictite| (геликтиты), |soda-straw| (сталактиты-соломины), |crystal| (кристаллы), |wall-calcite| (настенный\break кальцит), |popcorn| (коралиты), |disk| (диск), |gypsum| (гипс), |gypsum-flower| (гипсовые цветы), |aragonite| (арагонит), |cave-pearl| (пещерный жемчуг),\break |rimstone-pool| (гуры с водой), |rimstone-dam| (гуры без воды), |anastomosis| (анастомозис), |karren| (карры), |scallop| (фасетки), |flute| (канавки), |raft-cone| (высыпной конус), {5.4}|clay-tree| (глиняное деревце);

source: { station:}if station subtype is not specified, Therion reads it from centreline, if it's specified there] |temporary| (default), |painted|, |natural|, |fixed|;
ru_ru: { station (станция)}Если подтип станции не указан, Therion считает ее пикетом, если она указана в нитке хода.]{:} |temporary| (временная) (по умолчанию), |painted|\break (нарисованная), |natural| (естественная), |fixed| (фиксированная);

source: { survey:} |cave| (default), |surface| (default if centreline has surface flag).
ru_ru: { survey (нитка хода):} |cave| (пещерная) (по умолчанию), |surface|\break (поверхностная) (по умолчанию, если нитка хода имеет флаг surface).

source: { symbolic passage fills:}Unlike other point symbols, these are clipped by the scrap border.
ru_ru: { символы заполнения хода}В отличие от других точечных символов, они подрезаются границей скрапа.

source: { water-flow:} |permanent| (default), |conjectural|, |intermittent|;
ru_ru: { water-flow (водоток):} |permanent| (постоянный) (по умолчанию),\ \ |conjectural| (предполагаемый), |intermittent| (временный);

source: { water-flow:} |permanent| (default), |intermittent|, |paleo|.
ru_ru: { water-flow (водоток):} |permanent| (постоянный) (по умолчанию), |intermittent| (временный), |paleo| (палео-поток).

source: {=12pt 1= LET NO ONE IGNORANT OF GEOMETRY ENTER HERE 1 4pt {[1]{ageom.pdf}} to 1{ ---alleged inscription over the entrance} to 1{ of Plato's Academy, { 4}th century BC} }
ru_ru: {=12pt 1= ПУСТЬ НЕ ВХОДИТ НИКТО, НЕ ЗНАЮЩИЙ ГЕОМЕТРИИ 1 4pt {[1]{ageom.pdf}} to 1{ --- {\font\tt=fhar6a at 8px \tt предполагаемая фраза над входом}} to 1{ {\font\tt=fhar6a at 8px \tt в Академию Платона}, { 4} {\font\tt=fhar6a at 8px \tt век до н.э.}}

source: {={} 0pt =cmssdc10 at 36pt =cmssdc10 at 24pt { The Therion Book0pt} 365pt { Stacho Mudrak0pt} 20pt { Martin Budaj0pt}
ru_ru: {={} 20pt =fhab6a at 36pt =fhab6a at 24pt { Руководство по Therion'у0pt} 310pt { Stacho Mudrak0pt} 20pt { Martin Budaj0pt} 20pt {{\font\tt=fhar6a at 18px \tt Перевод -- Горбенко Алексей (http://vk.com/al\_gorb)}0pt}

source: { Auto adjust} calculates optimal size of the working area according to the sizes and positions of loaded background images.
ru_ru: { Авто} вычисляет оптимальный размер рабочей\break области в соответствии с размерами и позициями загруженных фоновых изображений.

source: { Dot} should be used for shots ending on features inside passage, { dash} for shots ending on passage walls, floor or ceiling.
ru_ru: { Точку} следует использовать для замеров, заканчивающихся внутри хода, { тире} для замеров, заканчивающихся на стенах хода, на полу или потолке.

source: { When deciding about scrap size please take into account the following:} Using small scraps may take more time for cartographer to optimize scrap joins.
ru_ru: {При определении размера скрапа учитывайте следующее:} использование небольших скрапов может потребовать больше времени для их обрисовки и для оптимизации их\break объединения.

source: {[100mm]{agrippa.jpg} -20mm 10pt105mm0mm1.05cm Only for you, children of doctrine and learning, have we written this work.
ru_ru: {[100mm]{agrippa.jpg} -20mm 10pt105mm0mm1.05cm Только для вас, детей\break доктрины и обучения, мы написали эту работу.

source: {Dipsplaying overlaying maps in offset}.
ru_ru: {Отображение перекрывающихся карт в смещении}.

source: {Stations in extended elevation scraps}.
ru_ru: {Станции в скрапах разрез-развертки}.
